app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'PG-13', 'R') ORDER BY title ASC
---
    end

    if @ratings and @sort
      @movies = Movie.where(:rating => @ratings.keys).find(:all, :order => (@sort))

SELECT "movies".* FROM "movies" ORDER BY release_date
---
    elsif @sort
      @movies = Movie.find(:all, :order => (@sort))
    else
      @movies = Movie.all